<template>
  <div class="agree">
    <div class="title">{{ content.title }}</div>
    <p v-for="(subs, index) in content.substrate" :key="index">{{ subs }}</p>
    <div v-for="(item, index) in content.items" :key="index">
      <div class="title-i">{{ item.title }}</div>
      <template v-for="(child, i_index) in item.child" :key="i_index">
        <!-- 存在父级时,再次遍历子对象 -->
        <div v-if="child.title">
          <p>{{ child.title }}</p>
          <div class="child-wrap">
            <p v-for="(c_child, c_index) in child.child" :key="c_index">{{ c_child }}</p>
          </div>
        </div>
        <p v-else>{{ child }}</p>
      </template>
    </div>
  </div>
</template>

<script setup lang="ts">
import { ref } from 'vue'

const content = ref<any>({
  title: '用户服务协议和隐私政策',
  substrate: [
    '《用户服务协议和隐私政策》（以下简称“协议”）及其条款，系您下载、安装及使用“Logger”（简称：logger）软件（以下简称“本软件”）所订立的、描述您与本软件之间权利义务的协议。',
    '在使用前务必认真阅读本协议的内容、充分理解各条款内容，如有异议，您可选择不进入本软件。一旦您确认本用户使用协议后，本协议即在您和本软件之间产生法律效力，意味着您完全同意并接受协议的全部条款。请您审慎阅读并选择接受或不接受协议（未成年人应在法定监护人陪同下阅读）。我们承诺会对您的个人信息和其它数据进行严格保密，并严格按照本政策所阐述的内容处理您的个人信息。我们会根据您的同意和其它可处理您个人信息的法律依据收集、使用、存储、共享和转移您的个人信息。',
  ],
  items: [
    {
      title: '1. 用户使用许可和限制：',
      child: [
        '(1) 本服务使用的软件程序，其所有权始终由我们或我们的供应商拥有，软件并非销售，只是授予您使用许可。在遵守本协议条款的前提下，您将被授予一个在单台设备上使用软件的有限的和非独家的许可。您仅限于在本协议明示允许的范围内使用软件。您不得：绕开软件中的任何技术限制；对软件进行反向工程、反编译或反汇编；复制、转让、出租、出售、分发或以其他方式提供软件。您可将获得的许可与设备一并一次性永久转让给第三方。某些软件或其组件可能基于随软件附带的开源许可证提供。仅就开源软件程序而言，开源许可证的条款优先适用并取代本协议的某些条款。未明确授予的所有其他权利均由我们或其供应商保留。您不得删除或更改软件的任何版权和所有权信息。',
        '(2) 您应意识到，我们通过本服务展示给您的内容，包括但可能不限于视频、音频、文字、图片等，均由我们或我们的许可方拥有全部和所有的权利和权益。您仅限于按原样随同本服务使用这些内容。未经我们事先书面许可，您不得修改、租赁、出租、出售、发布或分发上述内容（无论是全部还是部分），也不得对内容进行编译、改变或创作内容的任何派生作品。',
        '(3) 您理解，某些内容由第三方提供，我们可能无法完全控制展示的内容，我们将不为其无法控制的内容负责，您应自行决定是否以及如何使用这些内容，并承担相关的风险。我们可根据自己的判断，为符合法律或其他目的，随时删除、更换或修改某些内容。如您注意到有任何侵权或违法的内容，可按照我们版权政策描述详细情况并通知我们，我们将协调内容提供方解决或依法处理。',
      ],
    },
    {
      title: '2. 用户使用规范：',
      child: [
        '(1) 用户充分了解并同意，本软件为用户提供个性化信息服务，用户须为自己使用下的行为负责，包括用户所采集、传送的任何内容以及由此产生的任何后果，用户应对本软件中的内容自行加以判断，并承担因使用内容而引起的所有风险。本软件不对因用户行为而导致的损失承担责任。',
        '(2) 用户须对在本软件上所传送信息的真实性、合法性、有效性等负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与本软件无关。用户在本软件中记录的或通过本软件服务所传送的任何内容并不反映本软件的观点或政策，本软件对此不承担责任。',
        '(3) 用户提供的个人信息或发布的信息不真实、不准确、不合法；发表内容不符合本协议或发表内容不符合法律法规的，本软件有权暂停或终止用户使用本平台的服务。用户如果对本软件的暂停或者终止行为有异议，客户可向平台提出意见，要求其继续提供服务。本软件收到客户此类信息的投诉与意见，会审核相关信息，并及时对用户给予反馈。若信息确实不真实或不准确或不合法有效，本软件平台要求用户提供符合要求的信息。',
        '(4) 本软件有权针对用户发表的内容进行审核，若用户实施违反本条所述使用规则及法律法规的行为，本软件平台有权视行为严重程度，根据《侵权责任法》《信息网络传播权保护条例》等法律法规要求用户立即采取纠正、改正、恢复原状、消除影响等行为，且本软件有权自行采取合法有效且必要的措施（包括但不限于更改或删除相关侵权信息、暂停或终止用户使用本网络服务等），同时本软件保留进一步追究用户法律责任的权利，您应当独自承担由此而产生的一切法律责任，给我们造成任何损失的，或导致任何第三方对我们提出任何性质的权利请求的，您应赔偿我们遭受的所有损失并保证我们免于承担该等第三方的权利请求。同时，论坛社区版块（如有）发起者、管理者应当履行与本协议权利、法律法规相适应的义务，对违反法律规定和协议约定、履行责任义务不到位的服务提供者应当依法依约限制（更改或删除相关侵权信息、暂停使用）或取消其管理权限，直至封禁或者关闭有关账号、版块。',
        '(5) 用户不得将我们提供的服务用于非法目的或以任何非法方式使用我们提供的服务，包括但不限于通过我们提供的服务从事不法交易行为或从事侵害他人合法权益的行为；',
        '(6) 用户在注册或使用过程中不得提供虚假信息或冒充、利用他人信息；',
        '(7) 用户不得以任何方式危害本软件线上渠道及相关电子数据系统安全的；',
        '(8) 用户不得利用本软件服务制作、上载、复制、发布、传播或者转载如下内容： (1)违反宪法及其他法律、法规规定及其所确定的基本原则的信息; (2) 危害国家安全，泄露国家机密，颠覆国家政权，破坏国家统一的信息; (3) 损害国家荣誉和利益的信息; (4) 煽动民族仇恨、民族歧视，破坏民族团结的信息; (5) 破坏国家宗教政策，宣扬邪教和封建迷信的信息; (6)散布谣言，扰乱社会秩序，破坏社会稳定的信息; (7) 散布淫秽色情、赌博、暴力、恐怖或教唆犯罪的信息; (8) 侮辱或诽谤他人的信息; (9)煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的信息; (10) 以非法民间组织名义活动的信息; (11) 其他不符合“七条底线”要求的信息。',
        '(9) 用户禁止以文字、语音、图片等任何形式刻意宣传其他竞争平台；也禁止以相同的方式宣传非本软件联系方式，如果有聊天需求，可告知听众使用本软件私信联系。',
        '(10) 本软件保留因业务发展需要，单方面对其服务器所提供的全部或部分服务内容在任何时候不经任何通知的情况下变更、暂停、限制、终止或撤销服务的权利。',
      ],
    },
    {
      title: '3. 隐私政策：',
      child: [
        '本软件尊重并保护所有使用服务用户的个人隐私权，高度重视用户的隐私及个人信息的保护，本隐私政策帮助您了解我们收集哪些数据、为什么收集这些数据，会利用这些数据做些什么及如何保护这些数据。您的个人信息安全对我们来说至关重要。一直以来，本软件都致力于为每位用户提供更安全的互联网环境。我们将依据《中华人民共和国网络安全法》、《信息安全技术个人信息安全规范》（GB/T 35273-2017）以及其他相关法律法规和技术规范收集和使用您的个人信息，以帮助我们向您提供更优质的产品和/或服务。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本软件不会将这些信息对外披露或向第三方提供。',
        {
          title: '(1) 收集和使用个人信息的范围',
          child: [
            '- 设备信息：我们可能会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（包括ANDROID ID、IMEI、MAC、Serial、SIM卡IMSI识别码、设备机型、操作系统及版本、客户端版本、设备分辨率、包名、设备设置、进程及软件列表、唯一设备标识符、IDFA、软硬件特征信息）、设备所在位置相关信息（包括IP 地址、GPS位置以及能够提供相关信息的WLAN接入点、蓝牙和基站传感器信息）。',
            '- 信息发布功能：您在使用本软件服务时、上传和/或发布个人信息以及进行相关行为（包括用图文、电话、视频等方式提问、评价等）时，我们将收集您上传、发布或形成的个人信息，并有权展示您的昵称、头像和发布内容。我们将不时进行审核，并根据法律规定对该内容进行保存。',
            '- 客户服务：当您联系我们的客服或使用其他用户响应功能时（包括提出售中售后申请、个人信息保护投诉或建议、其他客户投诉和需求），我们可能需要您提供必要的个人信息以匹配并核验您的用户身份，以便保障您的账号与系统安全。我们可能还会保存您的联系方式（您与我们联系时使用的或您向我们主动提供的其他联系方式）、您与我们的通信/通话记录和内容、与您需求相关联的其他必要信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。如您拒绝提供上述信息，我们可能无法向您及时反馈投诉、申诉或咨询结果。',
            '- 日志信息：当您使用我们的服务时，我们可能会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。日志信息包括您的登录账号、搜索查询内容、IP地址、浏览器的类型、电信运营商、网络环境、使用的语言、访问日期和时间及您访问的网页浏览记录、Push打开记录、崩溃记录、停留时长、刷新记录、发布记录、关注、订阅、收藏及分享。',
            '- 改进我们的服务：我们可能将通过某一项本软件服务所收集的个人信息，用于我们的其他服务：在您使用某一项本软件服务时所收集的您的个人信息，可能在另一项本软件服务中用于向您提供特定内容或向您展示与您相关的、而非普遍推送的信息；我们可能让您参与有关本软件服务的调查，帮助我们改善现有服务或设计新服务；同时，我们可能将您的个人信息用于软件更新。 您了解并同意，在收集您的个人信息后，我们将通过技术手段对数据进行去标识化处理，去标识化处理的个人信息将无法识别您的身份，在此情况下我们有权使用已经去标识化的个人信息，对用户数据库进行分析并予以商业化的利用。',
            '- 其他用途：请您注意，如果我们要将您的个人信息用于本《隐私政策》中未载明的其他用途或额外收集未提及的其他个人信息，我们会另行事先请您同意（确认同意的方式：勾选、弹窗、站内信、邮件、短信方式）。一旦您同意，该等额外用途将视为本《隐私政策》的一部分，该等额外个人信息也将适用本《隐私政策》。',
          ],
        },
        {
          title: '(2) 征得授权同意的例外',
          child: [
            '根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意，并且本软件在法律法规规定范围内不承担任何责任：',
            '- 与国家安全、国防安全有关的；',
            '- 与公共安全、公共卫生、重大公共利益有关的；',
            '- 与犯罪侦查、起诉、审判和判决执行等有关的；',
            '- 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；',
            '- 所收集的个人信息是您自行向社会公众公开的；',
            '- 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；',
            '- 根据您的要求签订合同所必需的；',
            '- 用于维护本软件服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；',
            '- 为合法的新闻报道所必需的；',
            '- 学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；',
            '- 法律法规规定的其他情形。',
          ],
        },
        {
          title: '(3) 安全事件通知',
          child: [
            '- 在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们同时将及时将事件相关情况以短信、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。',
            '- 请您理解，由于技术的限制以及风险防范的局限，即便我们已经尽量加强安全措施，也无法始终保证个人信息百分之百的安全。您需要了解，您接入本软件服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。',
          ],
        },
        {
          title: '(4) 隐私政策的通知与修订',
          child: [
            '- 我们可能适时修改本《隐私政策》的条款，该等修改构成本《隐私政策》的一部分。对于重大变更，我们会提供更显著的通知，您如果不同意该等变更，可以选择停止使用本软件服务；如您仍然继续使用本软件服务的，即表示同意受经修订的本《隐私政策》的约束。',
            '- 我们的任何修改都会将您的满意度置于首位。我们鼓励您在每次使用本软件服务时都查阅我们的隐私政策。',
            '- 我们可能在必需时（例如当我们由于系统维护而暂停某一项服务时）发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。',
          ],
        },
      ],
    },
    {
      title: '4. 法律责任与免责：',
      child: [
        '(1) 本软件平台对平台进行停机维护、定期检查、更新软硬件、系统故障等因素导致的正常服务中断、中止，本软件不承担责任，本软件平台将尽力避免服务中断并将中断时间限制在最短时间内。',
        '(2) 因用户违反本协议或相关的服务条款的规定，导致或产生的任何第三方向本软件主张的索赔，由用户自行承担。',
        '(3) 请客户自行妥善保管个人资料，将个人信息提供足够保障及备份，并采取适当的预防措施降低电脑病毒或其他恶意破坏性举动的风险。',
        '(4) 我们对于您自平台而获得的所有他人、第三方的信息、内容或者广告宣传等任何资讯（以下统称“信息”），除法律明确规定外，不保证真实、准确和完整性。如果任何单位或者个人通过上述“信息”而进行任何行为，您须自行甄别真伪和谨慎预防风险。您在接受平台及服务时，有可能会接触到令人不快、不适当或令人厌恶的内容，在任何情况下，我们均不对任何此等内容承担任何责任。无论何种原因，我们不对任何非与我们直接发生的交易或行为承担任何直接、间接、附带或衍生的损失和责任。',
        {
          title:
            '(5) 鉴于互联网服务的特殊性，您理解并同意我们在以下情况下无需对您所遭受的损失（包括但不限于财产、收益、数据资料等方面的损失或其它无形损失）承担责任：',
          child: [
            '- 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素导致平台及服务障碍不能正常运作；',
            '- 由于计算机病毒、木马、其他恶意程序、黑客攻击、电信部门及网络运营公司技术调整或故障、系统维护等意外原因而造成平台及服务中断或延迟。',
            '- 其他因用户自身设备或自身通信网络包括但不限于局域网、内部网等问题导致的服务质量问题。',
          ],
        },
      ],
    },
    {
      title: '5. 知识产权：',
      child: [
        '(1) 本软件的一切知识产权，以及与软件相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图像、图表、色彩、界面设计、版面框架、有关数据、附加程序、印刷材料或电子文档等均归本软件所有，受著作权法和国际著作权条约以及其他知识产权法律法规的保护。',
        '(2) 未经本软件书面同意，用户不得为任何营利性或非营利性的目的自行实施、利用、转让或许可任何三方实施、利用、转让上述知识产权。出现上述未经许可之行为时，本软件保留追究相关责任人法律责任之权利。',
        '(3) 我们对软件中所包含的受知识产权或其他法律保护的资料享有相应的权利；除依法由用户享有著作权的内容之外，软件的整体内容的知识产权归我们或关联公司所有。',
        '(4) 您在使用我们服务时利用软件及服务所发表上传的文字、图片、视频、软件以及表演等原创信息的知识产权归您所有（或由第三方内容提供方和您另行约定），但是基于软件运营的需求，您确认您对该等信息的发表、上传行为视同为对我们授权知识产权的使用、复制、传播等权利。',
        '(5) 基于对数据的合法加工而获得的具有竞争性的数据权益，除法律法规另有规定外，我们享有独立的使用权益而无须获得您的同意。',
        '(6) 关于信息内容的投诉或举报。若您在使用软件过程中，不慎受到合法权益的侵犯，您有权通知我们采取必要措施进行处置。若您在使用软件过程中，发现存在违法违规或违反本服务相关规则的情况，您也有权向我们发起举报，我们亦会及时采取必要措施（删除、屏蔽、断开链接或限制使用功能等）进行处置。',
        '(7) 内容维权授权。在法律法规允许的范围内，您同意并授权我们就侵犯您合法权益的行为（包括但不限于私自复制、使用、编辑、抄袭等行为）采取任何形式的法律行动，包括但不限于投诉、诉讼等必要的维权措施。',
        '(8) 我们有权无需征得您的同意，采取包括但不限于删除账号或信息、断开链接、注销用户、停止权限等措施，针对您违反本协议，特别是违反本条侵犯他人合法权益进行处罚，并保留采取包括但不限于投诉、诉讼等必要的法律措施维护本平台权益的权利。',
      ],
    },
    {
      title: '6. 本协议的变更和终止：',
      child: [
        '(1) 我们可以随时更改本协议条款。我们可能会通过我们的网站、客户端公告或其他方式告知这些修改。您同意，发布此类更改后，如您继续使用本服务即表明您接受修改后的协议。',
        '(2) 您可以通过根据相关指示删除软件、关闭账号及停止使用服务等方式随时终止本协议。我们根据本协议约定取消全部服务时本协议终止。双方均不需为此承担任何责任。',
        '(3) 如发现您正在为任何未经允许的或本协议禁止的用途使用本服务，或如您的行为或状态使我们有理由认为继续向您提供服务可能给我们带来较大风险的，我们可根据自己的判断终止本协议，并就服务使用费及因您不当使用导致的损失向您索赔。',
        '(4) 您同意，本协议终止后，您应销毁软件并永久性地删除其所有备份，并且您使用服务的权利也将立即终止。',
        '(5) 本协议标题为“许可和限制”“无保证声明”“责任限制”“一般条款”及其他依据其性质始终有效的条款在本协议终止后继续有效。',
      ],
    },
    {
      title: '7. 通知：',
      child: [
        '(1) 您在接受本软件服务时，您应该本软件提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。',
        '(2) 本软件将向您的上述联系方式的其中之一或其中若干向您送达各类通知。平台信息发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。',
        '(3) 因您提供联系方式不正确或不详细导致的不利后果，一切责任由您自行承担。',
      ],
    },
    {
      title: '8. 法律适用、管辖与其他：',
      child: [
        '(1) 本软件郑重提醒用户注意本协议中可能存在的免除本软件责任和加重用户义务的条款，请用户仔细阅读，自主考虑风险。',
        '(2) 本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律；如法律无相关规定的，参照商业惯例或行业惯例。',
        '(3) 与本协议、使用本软件发生的任何争议或纠纷，双方应尽量友好协商解决；协商不成时，任何一方均有权将纠纷交由北京市海淀区人民法院管辖。',
        '(4) 本协议结合隐私权政策及援引的其他特别条款构成您与我们之间就本服务所达成的全部协议，并取代所有其他的沟通或交流，无论是口头的还是书面的。除非本协议另有约定，对本协议的任何修改均应以书面补充协议形式进行方为有效。我们未行使或强制执行包含在本协议中的任何权利或条款，不视为对相关权利和条款的放弃。',
        '(5) 本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。',
      ],
    },
    {
      title: '9. 其他：',
      child: [
        '(1) 您同意我们为履行本协议的目的，可通过电子邮件、手机短信、消息弹窗或其他信件传送等方式向您发送通知；同时，本协议项下我们对于用户所有的通知也可通过网页公告方式进行；该等通知于发送之日视为已送达收件人。您向我们发送的通知应当通过我们对外正式公布的通信地址、电子邮件地址等送达。',
      ],
    },
  ],
})
</script>

<style scoped lang="scss">
.agree {
  // background: $bg-color;
  height: 100%;
  overflow: auto;
  padding: 1rem;
  .title {
    text-align: center;
    font-size: 1.5rem;
    font-weight: 600;
    margin-bottom: 0.4rem;
  }
  .title-i {
    font-size: 1.1rem;
    font-weight: 500;
    margin-top: 0.8rem;
    margin-bottom: 0.5rem;
    text-indent: 1em;
  }
  p {
    text-indent: 2em;
  }
  .child-wrap {
    padding-left: 4em;
    p {
      text-indent: 0;
    }
  }
}
</style>
